; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-23)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	city23 - city
	city24 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl3)
	(at plane2 city4)
	(fuel-level plane2 fl6)
	(at plane3 city0)
	(fuel-level plane3 fl3)
	(at person1 city14)
	(at person2 city6)
	(at person3 city24)
	(at person4 city4)
	(at person5 city8)
	(at person6 city16)
	(at person7 city15)
	(at person8 city2)
	(at person9 city9)
	(at person10 city16)
	(at person11 city3)
	(at person12 city7)
	(at person13 city3)
	(at person14 city1)
	(at person15 city3)
	(at person16 city7)
	(at person17 city19)
	(at person18 city7)
	(at person19 city6)
	(at person20 city24)
	(at person21 city12)
	(at person22 city0)
	(at person23 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city24)
	(at person2 city0)
	(at person3 city12)
	(at person4 city8)
	(at person5 city3)
	(at person6 city18)
	(at person7 city9)
	(at person8 city16)
	(at person9 city18)
	(at person10 city14)
	(at person11 city3)
	(at person12 city9)
	(at person14 city13)
	(at person15 city22)
	(at person16 city14)
	(at person17 city4)
	(at person18 city6)
	(at person19 city16)
	(at person20 city7)
	(at person21 city11)
	(at person22 city18)
	(at person23 city22)
	))

)

; plan
1. (board person4 plane2 city4)
   deleted: (at person4 city4)
   added: (in person4 plane2)
   goals met: 1 of 22
2. (zoom plane2 city4 city8 fl6 fl5 fl4)
   deleted: (at plane2 city4) (fuel-level plane2 fl6)
   added: (at plane2 city8) (fuel-level plane2 fl4)
   goals met: 1 of 22
3. (board person5 plane2 city8)
   deleted: (at person5 city8)
   added: (in person5 plane2)
   goals met: 1 of 22
4. (zoom plane2 city8 city3 fl4 fl3 fl2)
   deleted: (at plane2 city8) (fuel-level plane2 fl4)
   added: (at plane2 city3) (fuel-level plane2 fl2)
   goals met: 1 of 22
5. (debark person5 plane2 city3)
   deleted: (in person5 plane2)
   added: (at person5 city3)
   goals met: 2 of 22
6. (board person15 plane2 city3)
   deleted: (at person15 city3)
   added: (in person15 plane2)
   goals met: 2 of 22
7. (zoom plane1 city0 city1 fl3 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 2 of 22
8. (board person22 plane3 city0)
   deleted: (at person22 city0)
   added: (in person22 plane3)
   goals met: 2 of 22
9. (zoom plane3 city0 city18 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city18) (fuel-level plane3 fl1)
   goals met: 2 of 22
10. (debark person22 plane3 city18)
   deleted: (in person22 plane3)
   added: (at person22 city18)
   goals met: 3 of 22
11. (board person14 plane1 city1)
   deleted: (at person14 city1)
   added: (in person14 plane1)
   goals met: 3 of 22
12. (fly plane1 city1 city13 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 3 of 22
13. (board person23 plane1 city13)
   deleted: (at person23 city13)
   added: (in person23 plane1)
   goals met: 3 of 22
14. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 22
15. (debark person14 plane1 city13)
   deleted: (in person14 plane1)
   added: (at person14 city13)
   goals met: 4 of 22
16. (fly plane1 city13 city22 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city22) (fuel-level plane1 fl0)
   goals met: 4 of 22
17. (debark person23 plane1 city22)
   deleted: (in person23 plane1)
   added: (at person23 city22)
   goals met: 5 of 22
18. (zoom plane2 city3 city22 fl2 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl2)
   added: (at plane2 city22) (fuel-level plane2 fl0)
   goals met: 5 of 22
19. (refuel plane2 city22 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 22
20. (debark person15 plane2 city22)
   deleted: (in person15 plane2)
   added: (at person15 city22)
   goals met: 6 of 22
21. (fly plane2 city22 city12 fl1 fl0)
   deleted: (at plane2 city22) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 6 of 22
22. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 22
23. (board person21 plane2 city12)
   deleted: (at person21 city12)
   added: (in person21 plane2)
   goals met: 6 of 22
24. (fly plane2 city12 city11 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 6 of 22
25. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 22
26. (debark person21 plane2 city11)
   deleted: (in person21 plane2)
   added: (at person21 city11)
   goals met: 7 of 22
27. (fly plane2 city11 city14 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 7 of 22
28. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 22
29. (board person1 plane2 city14)
   deleted: (at person1 city14)
   added: (in person1 plane2)
   goals met: 7 of 22
30. (fly plane3 city18 city15 fl1 fl0)
   deleted: (at plane3 city18) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 7 of 22
31. (board person7 plane3 city15)
   deleted: (at person7 city15)
   added: (in person7 plane3)
   goals met: 7 of 22
32. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 22
33. (fly plane3 city15 city9 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 7 of 22
34. (board person9 plane3 city9)
   deleted: (at person9 city9)
   added: (in person9 plane3)
   goals met: 7 of 22
35. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 22
36. (debark person7 plane3 city9)
   deleted: (in person7 plane3)
   added: (at person7 city9)
   goals met: 8 of 22
37. (fly plane2 city14 city24 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city24) (fuel-level plane2 fl0)
   goals met: 8 of 22
38. (refuel plane2 city24 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 22
39. (board person3 plane2 city24)
   deleted: (at person3 city24)
   added: (in person3 plane2)
   goals met: 8 of 22
40. (board person20 plane2 city24)
   deleted: (at person20 city24)
   added: (in person20 plane2)
   goals met: 8 of 22
41. (debark person1 plane2 city24)
   deleted: (in person1 plane2)
   added: (at person1 city24)
   goals met: 9 of 22
42. (fly plane2 city24 city12 fl1 fl0)
   deleted: (at plane2 city24) (fuel-level plane2 fl1)
   added: (at plane2 city12) (fuel-level plane2 fl0)
   goals met: 9 of 22
43. (refuel plane2 city12 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 22
44. (debark person3 plane2 city12)
   deleted: (in person3 plane2)
   added: (at person3 city12)
   goals met: 10 of 22
45. (fly plane2 city12 city7 fl1 fl0)
   deleted: (at plane2 city12) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 10 of 22
46. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 22
47. (debark person20 plane2 city7)
   deleted: (in person20 plane2)
   added: (at person20 city7)
   goals met: 11 of 22
48. (board person18 plane2 city7)
   deleted: (at person18 city7)
   added: (in person18 plane2)
   goals met: 11 of 22
49. (board person16 plane2 city7)
   deleted: (at person16 city7)
   added: (in person16 plane2)
   goals met: 11 of 22
50. (board person12 plane2 city7)
   deleted: (at person12 city7)
   added: (in person12 plane2)
   goals met: 11 of 22
51. (fly plane2 city7 city14 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 11 of 22
52. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 22
53. (debark person16 plane2 city14)
   deleted: (in person16 plane2)
   added: (at person16 city14)
   goals met: 12 of 22
54. (fly plane2 city14 city6 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 12 of 22
55. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 22
56. (board person2 plane2 city6)
   deleted: (at person2 city6)
   added: (in person2 plane2)
   goals met: 12 of 22
57. (board person19 plane2 city6)
   deleted: (at person19 city6)
   added: (in person19 plane2)
   goals met: 12 of 22
58. (debark person18 plane2 city6)
   deleted: (in person18 plane2)
   added: (at person18 city6)
   goals met: 13 of 22
59. (fly plane2 city6 city0 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 13 of 22
60. (refuel plane2 city0 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 22
61. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   goals met: 14 of 22
62. (fly plane2 city0 city16 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city16) (fuel-level plane2 fl0)
   goals met: 14 of 22
63. (refuel plane2 city16 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 22
64. (board person6 plane2 city16)
   deleted: (at person6 city16)
   added: (in person6 plane2)
   goals met: 14 of 22
65. (debark person19 plane2 city16)
   deleted: (in person19 plane2)
   added: (at person19 city16)
   goals met: 15 of 22
66. (board person10 plane2 city16)
   deleted: (at person10 city16)
   added: (in person10 plane2)
   goals met: 15 of 22
67. (fly plane3 city9 city19 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city19) (fuel-level plane3 fl0)
   goals met: 15 of 22
68. (refuel plane3 city19 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 15 of 22
69. (board person17 plane3 city19)
   deleted: (at person17 city19)
   added: (in person17 plane3)
   goals met: 15 of 22
70. (fly plane3 city19 city18 fl1 fl0)
   deleted: (at plane3 city19) (fuel-level plane3 fl1)
   added: (at plane3 city18) (fuel-level plane3 fl0)
   goals met: 15 of 22
71. (refuel plane3 city18 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 15 of 22
72. (debark person9 plane3 city18)
   deleted: (in person9 plane3)
   added: (at person9 city18)
   goals met: 16 of 22
73. (fly plane3 city18 city2 fl1 fl0)
   deleted: (at plane3 city18) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 16 of 22
74. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 16 of 22
75. (board person8 plane3 city2)
   deleted: (at person8 city2)
   added: (in person8 plane3)
   goals met: 16 of 22
76. (fly plane3 city2 city16 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 16 of 22
77. (refuel plane3 city16 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 16 of 22
78. (debark person8 plane3 city16)
   deleted: (in person8 plane3)
   added: (at person8 city16)
   goals met: 17 of 22
79. (fly plane3 city16 city4 fl1 fl0)
   deleted: (at plane3 city16) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 17 of 22
80. (debark person17 plane3 city4)
   deleted: (in person17 plane3)
   added: (at person17 city4)
   goals met: 18 of 22
81. (fly plane2 city16 city14 fl1 fl0)
   deleted: (at plane2 city16) (fuel-level plane2 fl1)
   added: (at plane2 city14) (fuel-level plane2 fl0)
   goals met: 18 of 22
82. (refuel plane2 city14 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 18 of 22
83. (debark person10 plane2 city14)
   deleted: (in person10 plane2)
   added: (at person10 city14)
   goals met: 19 of 22
84. (fly plane2 city14 city18 fl1 fl0)
   deleted: (at plane2 city14) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 19 of 22
85. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 19 of 22
86. (debark person6 plane2 city18)
   deleted: (in person6 plane2)
   added: (at person6 city18)
   goals met: 20 of 22
87. (fly plane2 city18 city8 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 20 of 22
88. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 20 of 22
89. (debark person4 plane2 city8)
   deleted: (in person4 plane2)
   added: (at person4 city8)
   goals met: 21 of 22
90. (fly plane2 city8 city9 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 21 of 22
91. (debark person12 plane2 city9)
   deleted: (in person12 plane2)
   added: (at person12 city9)
   goals met: 22 of 22
